vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32c092/SYSCFG_registers.h
/* This file is generated by stm32_reggen.py from stm32c092xx.h
 * Do not edit this file manually! 
 * If corrections are needed, use the 
 * override mechanism(s) defined to modify the parsed results 
 * and re-run the script to update the file. 
 *
 * This file contains the SYSCFG register type definitions for the stm32c092 series of chips. 
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "SYSCFG_index.h"


typedef union { 
	struct {
		uint32_t MEM_MODE      : 2; // /*!< SYSCFG_Memory Remap Config */
		uint32_t _reserved2    : 1; 
		uint32_t PA11_RMP      : 1; // /*!< PA11 Remap */
		uint32_t PA12_RMP      : 1; // /*!< PA12 Remap */
		uint32_t IR_POL        : 1; // /*!< IROut Polarity Selection */
		uint32_t IR_MOD        : 2; // /*!< IRDA Modulation Envelope signal source selection */
		uint32_t _reserved8    : 8; 
		uint32_t I2C_PB6_FMP   : 1; // /*!< I2C PB6 Fast mode plus */
		uint32_t I2C_PB7_FMP   : 1; // /*!< I2C PB7 Fast mode plus */
		uint32_t I2C_PB8_FMP   : 1; // /*!< I2C PB8 Fast mode plus */
		uint32_t I2C_PB9_FMP   : 1; // /*!< I2C PB9 Fast mode plus */
		uint32_t I2C1_FMP      : 1; // /*!< Enable Fast Mode Plus on PB10, PB11, PF6 and PF7  */
		uint32_t I2C2_FMP      : 1; // /*!< Enable I2C2 Fast mode plus  */
		uint32_t I2C_PA9_FMP   : 1; // /*!< Enable Fast Mode Plus on PA9  */
		uint32_t I2C_PA10_FMP  : 1; // /*!< Enable Fast Mode Plus on PA10 */
		uint32_t I2C_PC14_FMP  : 1; // /*!< Enable Fast Mode Plus on PC14 */
		uint32_t _reserved25   : 7; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,cfgr1); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,cfgr1),bits);

typedef union { 
	struct {
		uint32_t CLL           : 1; // /*!< Enables and locks the LOCKUP (Hardfault) output of CortexM0 with Break Input of TIMER1/16/17 */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,cfgr2); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,cfgr2),bits);

typedef union { 
	struct {
		uint32_t PINMUX0       : 2; // /*!< Pin GPIO multiplexer 0 */
		uint32_t PINMUX1       : 2; // /*!< Pin GPIO multiplexer 1 */
		uint32_t PINMUX2       : 2; // /*!< Pin GPIO multiplexer 2 */
		uint32_t PINMUX3       : 2; // /*!< Pin GPIO multiplexer 3 */
		uint32_t PINMUX4       : 2; // /*!< Pin GPIO multiplexer 4 */
		uint32_t _reserved10   :22; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,cfgr3); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,cfgr3),bits);

typedef union { 
	struct {
		uint32_t WWDG          : 1; // /*!< EWDG interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline0); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline0),bits);

typedef union { 
	struct {
		uint32_t _reserved0    :32; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline1); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline1),bits);

typedef union { 
	struct {
		uint32_t _reserved0    : 1; 
		uint32_t TC            : 1; // /*!< RTC interrupt */
		uint32_t _reserved2    :30; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline2); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline2),bits);

typedef union { 
	struct {
		uint32_t _reserved0    : 1; 
		uint32_t FLASH_ITF     : 1; // /*!< FLASH ITF interrupt */
		uint32_t _reserved2    :30; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline3); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline3),bits);

typedef union { 
	struct {
		uint32_t CC            : 1; // /*!< RCC interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline4); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline4),bits);

typedef union { 
	struct {
		uint32_t EXTI0         : 1; // /*!< External Interrupt 0 */
		uint32_t EXTI1         : 1; // /*!< External Interrupt 1 */
		uint32_t _reserved2    :30; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline5); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline5),bits);

typedef union { 
	struct {
		uint32_t EXTI2         : 1; // /*!< External Interrupt 2 */
		uint32_t EXTI3         : 1; // /*!< External Interrupt 3 */
		uint32_t _reserved2    :30; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline6); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline6),bits);

typedef union { 
	struct {
		uint32_t EXTI4         : 1; // /*!< External Interrupt 4 */
		uint32_t EXTI5         : 1; // /*!< External Interrupt 5 */
		uint32_t EXTI6         : 1; // /*!< External Interrupt 6 */
		uint32_t EXTI7         : 1; // /*!< External Interrupt 7 */
		uint32_t EXTI8         : 1; // /*!< External Interrupt 8 */
		uint32_t EXTI9         : 1; // /*!< External Interrupt 9 */
		uint32_t EXTI10        : 1; // /*!< External Interrupt 10 */
		uint32_t EXTI11        : 1; // /*!< External Interrupt 11 */
		uint32_t EXTI12        : 1; // /*!< External Interrupt 12 */
		uint32_t EXTI13        : 1; // /*!< External Interrupt 13 */
		uint32_t EXTI14        : 1; // /*!< External Interrupt 14 */
		uint32_t EXTI15        : 1; // /*!< External Interrupt 15 */
		uint32_t _reserved12   :20; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline7); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline7),bits);

typedef union { 
	struct {
		uint32_t _reserved0    :32; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline8); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline8),bits);

typedef union { 
	struct {
		uint32_t DMA1_CH1      : 1; // /*!< DMA1 Channel 1 Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline9); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline9),bits);

typedef union { 
	struct {
		uint32_t DMA1_CH2      : 1; // /*!< DMA1 Channel 2 Interrupt */
		uint32_t DMA1_CH3      : 1; // /*!< DMA1 Channel 3 Interrupt */
		uint32_t _reserved2    :30; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline10); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline10),bits);

typedef union { 
	struct {
		uint32_t DMAMUX1       : 1; // /*!< DMAMUX Interrupt */
		uint32_t DMA1_CH4      : 1; // /*!< DMA1 CH4 Interrupt */
		uint32_t DMA1_CH5      : 1; // /*!< DMA1 CH5 Interrupt */
		uint32_t DMA1_CH6      : 1; // /*!< DMA1 CH6 Interrupt */
		uint32_t DMA1_CH7      : 1; // /*!< DMA1 CH7 Interrupt */
		uint32_t _reserved5    :27; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline11); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline11),bits);

typedef union { 
	struct {
		uint32_t ADC           : 1; // /*!< ADC Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline12); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline12),bits);

typedef union { 
	struct {
		uint32_t TIM1_CCU      : 1; // /*!< TIM1 CCU Interrupt */
		uint32_t TIM1_TRG      : 1; // /*!< TIM1 TRG Interrupt */
		uint32_t TIM1_UPD      : 1; // /*!< TIM1 UPD Interrupt */
		uint32_t TIM1_BRK      : 1; // /*!< TIM1 BRK Interrupt */
		uint32_t _reserved4    :28; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline13); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline13),bits);

typedef union { 
	struct {
		uint32_t TIM1_CC       : 1; // /*!< TIM1 CC Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline14); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline14),bits);

typedef union { 
	struct {
		uint32_t TIM2          : 1; // /*!< TIM2 GLB Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline15); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline15),bits);

typedef union { 
	struct {
		uint32_t TIM3_GLB      : 1; // /*!< TIM3 GLB Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline16); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline16),bits);

typedef union { 
	struct {
		uint32_t _reserved0    :32; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline17); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline17),bits);

typedef union { 
	struct {
		uint32_t _reserved0    :32; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline18); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline18),bits);

typedef union { 
	struct {
		uint32_t TIM14_GLB     : 1; // /*!< TIM14 GLB Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline19); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline19),bits);

typedef union { 
	struct {
		uint32_t TIM15_GLB     : 1; // /*!< TIM15 GLB Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline20); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline20),bits);

typedef union { 
	struct {
		uint32_t TIM16_GLB     : 1; // /*!< TIM16 GLB Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline21); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline21),bits);

typedef union { 
	struct {
		uint32_t TIM17_GLB     : 1; // /*!< TIM17 GLB Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline22); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline22),bits);

typedef union { 
	struct {
		uint32_t I2C1_GLB      : 1; // /*!< I2C1 GLB Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline23); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline23),bits);

typedef union { 
	struct {
		uint32_t I2C2_GLB      : 1; // /*!< I2C2 GLB Interrupt  -> exti[22]*/
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline24); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline24),bits);

typedef union { 
	struct {
		uint32_t PI1           : 1; // /*!< SPI1 Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline25); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline25),bits);

typedef union { 
	struct {
		uint32_t PI2           : 1; // /*!< SPI2  Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline26); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline26),bits);

typedef union { 
	struct {
		uint32_t USART1_GLB    : 1; // /*!< USART1 GLB Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline27); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline27),bits);

typedef union { 
	struct {
		uint32_t USART2_GLB    : 1; // /*!< USART2 GLB Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline28); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline28),bits);

typedef union { 
	struct {
		uint32_t USART3_GLB    : 1; // /*!< USART3 GLB Interrupt */
		uint32_t USART4_GLB    : 1; // /*!< USART3 GLB Interrupt */
		uint32_t _reserved2    :30; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline29); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline29),bits);

typedef union { 
	struct {
		uint32_t FDCAN1_IT0    : 1; // /*!< FDCAN1 IT0 Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline30); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline30),bits);

typedef union { 
	struct {
		uint32_t FDCAN1_IT1    : 1; // /*!< FDCAN1 IT1 Interrupt */
		uint32_t _reserved1    :31; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_syscfg,itline31); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_syscfg,itline31),bits);

static const stm32_reginfo_t stm32_c092_syscfg_reginfo[RI_END] = 
{ 
	[RI_CFGR1          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x01FF00F8, .mask = 0x01FF00FB }, /* mask = 0b00000001111111110000000011111011 */
	[RI_CFGR2          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_CFGR3          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x000003FF, .mask = 0x000003FF }, /* mask = 0b00000000000000000000001111111111 */
	[RI_ITLINE0        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE1        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_ITLINE2        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000002, .mask = 0x00000002 }, /* mask = 0b00000000000000000000000000000010 */
	[RI_ITLINE3        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000002, .mask = 0x00000002 }, /* mask = 0b00000000000000000000000000000010 */
	[RI_ITLINE4        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE5        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000003, .mask = 0x00000003 }, /* mask = 0b00000000000000000000000000000011 */
	[RI_ITLINE6        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000003, .mask = 0x00000003 }, /* mask = 0b00000000000000000000000000000011 */
	[RI_ITLINE7        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000FFF, .mask = 0x00000FFF }, /* mask = 0b00000000000000000000111111111111 */
	[RI_ITLINE8        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_ITLINE9        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE10       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000003, .mask = 0x00000003 }, /* mask = 0b00000000000000000000000000000011 */
	[RI_ITLINE11       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0000001F, .mask = 0x0000001F }, /* mask = 0b00000000000000000000000000011111 */
	[RI_ITLINE12       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE13       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0000000F, .mask = 0x0000000F }, /* mask = 0b00000000000000000000000000001111 */
	[RI_ITLINE14       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE15       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE16       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE17       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_ITLINE18       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000000 }, /* mask = 0b00000000000000000000000000000000 */
	[RI_ITLINE19       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE20       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE21       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE22       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE23       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE24       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE25       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE26       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE27       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE28       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE29       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000003, .mask = 0x00000003 }, /* mask = 0b00000000000000000000000000000011 */
	[RI_ITLINE30       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_ITLINE31       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
}; 

typedef union { 
	struct {
		REGDEF_NAME(c092_syscfg,cfgr1) CFGR1;
		uint32_t _reserved0x4[ 5]; 
		REGDEF_NAME(c092_syscfg,cfgr2) CFGR2;
		uint32_t _reserved0x1C[ 8]; 
		REGDEF_NAME(c092_syscfg,cfgr3) CFGR3;
		uint32_t _reserved0x40[16]; 
		REGDEF_NAME(c092_syscfg,itline0) ITLINE0;
		REGDEF_NAME(c092_syscfg,itline1) ITLINE1;
		REGDEF_NAME(c092_syscfg,itline2) ITLINE2;
		REGDEF_NAME(c092_syscfg,itline3) ITLINE3;
		REGDEF_NAME(c092_syscfg,itline4) ITLINE4;
		REGDEF_NAME(c092_syscfg,itline5) ITLINE5;
		REGDEF_NAME(c092_syscfg,itline6) ITLINE6;
		REGDEF_NAME(c092_syscfg,itline7) ITLINE7;
		REGDEF_NAME(c092_syscfg,itline8) ITLINE8;
		REGDEF_NAME(c092_syscfg,itline9) ITLINE9;
		REGDEF_NAME(c092_syscfg,itline10) ITLINE10;
		REGDEF_NAME(c092_syscfg,itline11) ITLINE11;
		REGDEF_NAME(c092_syscfg,itline12) ITLINE12;
		REGDEF_NAME(c092_syscfg,itline13) ITLINE13;
		REGDEF_NAME(c092_syscfg,itline14) ITLINE14;
		REGDEF_NAME(c092_syscfg,itline15) ITLINE15;
		REGDEF_NAME(c092_syscfg,itline16) ITLINE16;
		REGDEF_NAME(c092_syscfg,itline17) ITLINE17;
		REGDEF_NAME(c092_syscfg,itline18) ITLINE18;
		REGDEF_NAME(c092_syscfg,itline19) ITLINE19;
		REGDEF_NAME(c092_syscfg,itline20) ITLINE20;
		REGDEF_NAME(c092_syscfg,itline21) ITLINE21;
		REGDEF_NAME(c092_syscfg,itline22) ITLINE22;
		REGDEF_NAME(c092_syscfg,itline23) ITLINE23;
		REGDEF_NAME(c092_syscfg,itline24) ITLINE24;
		REGDEF_NAME(c092_syscfg,itline25) ITLINE25;
		REGDEF_NAME(c092_syscfg,itline26) ITLINE26;
		REGDEF_NAME(c092_syscfg,itline27) ITLINE27;
		REGDEF_NAME(c092_syscfg,itline28) ITLINE28;
		REGDEF_NAME(c092_syscfg,itline29) ITLINE29;
		REGDEF_NAME(c092_syscfg,itline30) ITLINE30;
		REGDEF_NAME(c092_syscfg,itline31) ITLINE31;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END]; 
}  REGDEF_NAME(c092,syscfg); 
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(c092,syscfg)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), CFGR1) != 0, "Offset mismatch for CFGR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), CFGR2) != 24, "Offset mismatch for CFGR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), CFGR3) != 60, "Offset mismatch for CFGR3");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE0) != 128, "Offset mismatch for ITLINE0");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE1) != 132, "Offset mismatch for ITLINE1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE2) != 136, "Offset mismatch for ITLINE2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE3) != 140, "Offset mismatch for ITLINE3");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE4) != 144, "Offset mismatch for ITLINE4");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE5) != 148, "Offset mismatch for ITLINE5");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE6) != 152, "Offset mismatch for ITLINE6");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE7) != 156, "Offset mismatch for ITLINE7");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE8) != 160, "Offset mismatch for ITLINE8");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE9) != 164, "Offset mismatch for ITLINE9");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE10) != 168, "Offset mismatch for ITLINE10");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE11) != 172, "Offset mismatch for ITLINE11");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE12) != 176, "Offset mismatch for ITLINE12");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE13) != 180, "Offset mismatch for ITLINE13");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE14) != 184, "Offset mismatch for ITLINE14");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE15) != 188, "Offset mismatch for ITLINE15");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE16) != 192, "Offset mismatch for ITLINE16");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE17) != 196, "Offset mismatch for ITLINE17");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE18) != 200, "Offset mismatch for ITLINE18");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE19) != 204, "Offset mismatch for ITLINE19");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE20) != 208, "Offset mismatch for ITLINE20");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE21) != 212, "Offset mismatch for ITLINE21");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE22) != 216, "Offset mismatch for ITLINE22");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE23) != 220, "Offset mismatch for ITLINE23");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE24) != 224, "Offset mismatch for ITLINE24");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE25) != 228, "Offset mismatch for ITLINE25");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE26) != 232, "Offset mismatch for ITLINE26");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE27) != 236, "Offset mismatch for ITLINE27");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE28) != 240, "Offset mismatch for ITLINE28");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE29) != 244, "Offset mismatch for ITLINE29");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE30) != 248, "Offset mismatch for ITLINE30");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,syscfg), ITLINE31) != 252, "Offset mismatch for ITLINE31");
